; ModuleID = 'prog'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_s = type { %struct.rbnode_s*, %struct.rbnode_s*, i64, i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }
%struct.rbnode_s = type { i8*, i8*, i8, %struct.rbnode_s*, %struct.rbnode_s*, %struct.rbnode_s* }
%struct.treetable_conf_s = type { i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }

@__const.main.value1 = private unnamed_addr constant [4 x i8] c"aaa\00", align 1
@__const.main.value2 = private unnamed_addr constant [4 x i8] c"bbb\00", align 1
@.str = private unnamed_addr constant [5 x i8] c"key1\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"key2\00", align 1
@.str.2 = private unnamed_addr constant [24 x i8] c"(char*) value == value1\00", align 1
@.str.3 = private unnamed_addr constant [12 x i8] c"add_nodes.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [11 x i8] c"int main()\00", align 1
@.str.4 = private unnamed_addr constant [24 x i8] c"(char*) value == value2\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main() #0 !dbg !34 {
entry:
  %retval = alloca i32, align 4
  %table = alloca %struct.treetable_s*, align 8
  %key1 = alloca i32, align 4
  %key2 = alloca i32, align 4
  %value1 = alloca [4 x i8], align 1
  %value2 = alloca [4 x i8], align 1
  %value = alloca i8*, align 8

!48 = !DILocalVariable(name: "value1", scope: !34, file: !1, line: 14, type: !49)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !5, size: 32, elements: !50)
!50 = !{!51}
!51 = !DISubrange(count: 4)
!52 = !DILocation(line: 14, column: 10, scope: !34)
!53 = !DILocalVariable(name: "value2", scope: !34, file: !1, line: 15, type: !49)
!54 = !DILocation(line: 15, column: 10, scope: !34)
!55 = !DILocation(line: 17, column: 24, scope: !34)
!56 = !DILocation(line: 17, column: 5, scope: !34)
!57 = !DILocation(line: 18, column: 24, scope: !34)
!58 = !DILocation(line: 18, column: 5, scope: !34)
!59 = !DILocation(line: 20, column: 19, scope: !34)
!60 = !DILocation(line: 20, column: 26, scope: !34)
!61 = !DILocation(line: 20, column: 33, scope: !34)
!62 = !DILocation(line: 20, column: 5, scope: !34)
!63 = !DILocation(line: 21, column: 19, scope: !34)
!64 = !DILocation(line: 21, column: 26, scope: !34)
!65 = !DILocation(line: 21, column: 33, scope: !34)
!66 = !DILocation(line: 21, column: 5, scope: !34)
!67 = !DILocalVariable(name: "value", scope: !34, file: !1, line: 23, type: !25)
!68 = !DILocation(line: 23, column: 11, scope: !34)
!69 = !DILocation(line: 24, column: 9, scope: !70)
!70 = distinct !DILexicalBlock(scope: !34, file: !1, line: 24, column: 9)
!71 = !DILocation(line: 24, column: 17, scope: !70)
!72 = !DILocation(line: 24, column: 14, scope: !70)
!73 = !DILocation(line: 24, column: 22, scope: !70)
!74 = !DILocation(line: 24, column: 48, scope: !70)
!75 = !DILocation(line: 24, column: 55, scope: !70)
!76 = !DILocation(line: 24, column: 25, scope: !70)
!77 = !DILocation(line: 24, column: 9, scope: !34)
!78 = !DILocation(line: 25, column: 23, scope: !79)
!79 = distinct !DILexicalBlock(scope: !70, file: !1, line: 24, column: 62)
!80 = !DILocation(line: 25, column: 30, scope: !79)
!81 = !DILocation(line: 25, column: 9, scope: !79)
!82 = !DILocation(line: 26, column: 9, scope: !83)
!83 = distinct !DILexicalBlock(scope: !84, file: !1, line: 26, column: 9)
!84 = distinct !DILexicalBlock(scope: !79, file: !1, line: 26, column: 9)
!85 = !DILocation(line: 26, column: 9, scope: !84)
!86 = !DILocation(line: 29, column: 32, scope: !87)
!87 = distinct !DILexicalBlock(scope: !34, file: !1, line: 29, column: 9)
!88 = !DILocation(line: 29, column: 39, scope: !87)
!89 = !DILocation(line: 29, column: 9, scope: !87)
!90 = !DILocation(line: 29, column: 9, scope: !34)
!91 = !DILocation(line: 30, column: 23, scope: !92)
!92 = distinct !DILexicalBlock(scope: !87, file: !1, line: 29, column: 46)
!93 = !DILocation(line: 30, column: 30, scope: !92)
!94 = !DILocation(line: 30, column: 9, scope: !92)
!95 = !DILocation(line: 31, column: 9, scope: !96)
!96 = distinct !DILexicalBlock(scope: !97, file: !1, line: 31, column: 9)
!97 = distinct !DILexicalBlock(scope: !92, file: !1, line: 31, column: 9)
!98 = !DILocation(line: 31, column: 9, scope: !97)
!99 = !DILocation(line: 34, column: 23, scope: !34)
!100 = !DILocation(line: 34, column: 5, scope: !34)
!101 = !DILocation(line: 35, column: 1, scope: !34)
!102 = distinct !DISubprogram(name: "cmp", scope: !7, file: !7, line: 53, type: !103, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2)
!103 = !DISubroutineType(types: !104)
!104 = !{!24, !105, !105}
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!107 = !DILocalVariable(name: "e1", arg: 1, scope: !102, file: !7, line: 53, type: !105)
!108 = !DILocation(line: 53, column: 21, scope: !102)
!109 = !DILocalVariable(name: "e2", arg: 2, scope: !102, file: !7, line: 53, type: !105)
!110 = !DILocation(line: 53, column: 37, scope: !102)
!111 = !DILocalVariable(name: "i", scope: !102, file: !7, line: 54, type: !24)
!112 = !DILocation(line: 54, column: 9, scope: !102)
!113 = !DILocation(line: 54, column: 22, scope: !102)
!114 = !DILocation(line: 54, column: 15, scope: !102)
!115 = !DILocation(line: 54, column: 13, scope: !102)
!116 = !DILocalVariable(name: "j", scope: !102, file: !7, line: 55, type: !24)
!117 = !DILocation(line: 55, column: 9, scope: !102)
!118 = !DILocation(line: 55, column: 22, scope: !102)
!119 = !DILocation(line: 55, column: 15, scope: !102)
!120 = !DILocation(line: 55, column: 13, scope: !102)
!121 = !DILocation(line: 57, column: 9, scope: !122)
!122 = distinct !DILexicalBlock(scope: !102, file: !7, line: 57, column: 9)
!123 = !DILocation(line: 57, column: 13, scope: !122)
!124 = !DILocation(line: 57, column: 11, scope: !122)
!125 = !DILocation(line: 57, column: 9, scope: !102)
!126 = !DILocation(line: 58, column: 9, scope: !122)
!127 = !DILocation(line: 59, column: 9, scope: !128)
!128 = distinct !DILexicalBlock(scope: !102, file: !7, line: 59, column: 9)
!129 = !DILocation(line: 59, column: 14, scope: !128)
!130 = !DILocation(line: 59, column: 11, scope: !128)
!131 = !DILocation(line: 59, column: 9, scope: !102)
!132 = !DILocation(line: 60, column: 9, scope: !128)
!133 = !DILocation(line: 61, column: 5, scope: !102)
!134 = !DILocation(line: 62, column: 1, scope: !102)
!135 = distinct !DISubprogram(name: "treetable_conf_init", scope: !7, file: !7, line: 70, type: !136, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2)
!136 = !DISubroutineType(types: !137)
!137 = !{null, !138}
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !140, line: 94, baseType: !141)
!140 = !DIFile(filename: "./treetable.h", directory: "/home/klee/klee_src/examples/trabalho2")
!141 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !140, line: 89, size: 256, elements: !142)
!142 = !{!143, !145, !152, !156}
!143 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !141, file: !140, line: 90, baseType: !144, size: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !141, file: !140, line: 91, baseType: !146, size: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !147, size: 64)
!147 = !DISubroutineType(types: !148)
!148 = !{!25, !149}
!149 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !150, line: 46, baseType: !151)
!150 = !DIFile(filename: "/tmp/llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "")
!151 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !141, file: !140, line: 92, baseType: !153, size: 64, offset: 128)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DISubroutineType(types: !155)
!155 = !{!25, !149, !149}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !141, file: !140, line: 93, baseType: !157, size: 64, offset: 192)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !25}
!160 = !DILocalVariable(name: "conf", arg: 1, scope: !135, file: !7, line: 70, type: !138)
!161 = !DILocation(line: 70, column: 41, scope: !135)
!162 = !DILocation(line: 72, column: 5, scope: !135)
!163 = !DILocation(line: 72, column: 11, scope: !135)
!164 = !DILocation(line: 72, column: 22, scope: !135)
!165 = !DILocation(line: 73, column: 5, scope: !135)
!166 = !DILocation(line: 73, column: 11, scope: !135)
!167 = !DILocation(line: 73, column: 22, scope: !135)
!168 = !DILocation(line: 74, column: 5, scope: !135)
!169 = !DILocation(line: 74, column: 11, scope: !135)
!170 = !DILocation(line: 74, column: 22, scope: !135)
!171 = !DILocation(line: 75, column: 5, scope: !135)
!172 = !DILocation(line: 75, column: 11, scope: !135)
!173 = !DILocation(line: 75, column: 22, scope: !135)
!174 = !DILocation(line: 76, column: 1, scope: !135)
!175 = distinct !DISubprogram(name: "treetable_new", scope: !7, file: !7, line: 87, type: !176, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2)
!176 = !DISubroutineType(types: !177)
!177 = !{!9, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !179, size: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64)
!180 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !140, line: 30, baseType: !181)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !7, line: 30, size: 448, elements: !182)
!182 = !{!183, !195, !196, !197, !198, !199, !200}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !181, file: !7, line: 31, baseType: !184, size: 64)
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !185, size: 64)
!185 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !140, line: 61, baseType: !186)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !140, line: 37, size: 384, elements: !187)
!187 = !{!188, !189, !190, !191, !193, !194}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !186, file: !140, line: 40, baseType: !25, size: 64)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !186, file: !140, line: 44, baseType: !25, size: 64, offset: 64)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !186, file: !140, line: 48, baseType: !5, size: 8, offset: 128)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !186, file: !140, line: 52, baseType: !192, size: 64, offset: 192)
!192 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !186, size: 64)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !186, file: !140, line: 56, baseType: !192, size: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !186, file: !140, line: 60, baseType: !192, size: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !181, file: !7, line: 32, baseType: !184, size: 64, offset: 64)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !181, file: !7, line: 33, baseType: !149, size: 64, offset: 128)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !181, file: !7, line: 35, baseType: !144, size: 64, offset: 192)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !181, file: !7, line: 36, baseType: !146, size: 64, offset: 256)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !181, file: !7, line: 37, baseType: !153, size: 64, offset: 320)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !181, file: !7, line: 38, baseType: !157, size: 64, offset: 384)
!201 = !DILocalVariable(name: "tt", arg: 1, scope: !175, file: !7, line: 87, type: !178)
!202 = !DILocation(line: 87, column: 40, scope: !175)
!203 = !DILocalVariable(name: "conf", scope: !175, file: !7, line: 89, type: !139)
!204 = !DILocation(line: 89, column: 19, scope: !175)
!205 = !DILocation(line: 90, column: 5, scope: !175)
!206 = !DILocation(line: 91, column: 38, scope: !175)
!207 = !DILocation(line: 91, column: 12, scope: !175)
!208 = !DILocation(line: 91, column: 5, scope: !175)
!209 = distinct !DISubprogram(name: "treetable_new_conf", scope: !7, file: !7, line: 107, type: !210, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !6, retainedNodes: !2)
!210 = !DISubroutineType(types: !211)
!211 = !{!9, !212, !178}
!212 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !139)
!215 = !DILocalVariable(name: "conf", arg: 1, scope: !209, file: !7, line: 107, type: !212)
!216 = !DILocation(line: 107, column: 61, scope: !209)
!217 = !DILocalVariable(name: "tt", arg: 2, scope: !209, file: !7, line: 107, type: !178)
!218 = !DILocation(line: 107, column: 79, scope: !209)
!219 = !DILocalVariable(name: "table", scope: !209, file: !7, line: 109, type: !179)
!220 = !DILocation(line: 109, column: 16, scope: !209)
!221 = !DILocation(line: 109, column: 24, scope: !209)
!222 = !DILocation(line: 109, column: 30, scope: !209)
!223 = !DILocation(line: 111, column: 10, scope: !224)
!224 = distinct !DILexicalBlock(scope: !209, file: !7, line: 111, column: 9)
!225 = !DILocation(line: 111, column: 9, scope: !209)
!226 = !DILocation(line: 112, column: 9, scope: !224)
!227 = !DILocalVariable(name: "sentinel", scope: !209, file: !7, line: 114, type: !184)
!228 = !DILocation(line: 114, column: 13, scope: !209)
!229 = !DILocation(line: 114, column: 24, scope: !209)
!230 = !DILocation(line: 114, column: 30, scope: !209)
!231 = !DILocation(line: 116, column: 10, scope: !232)
!232 = distinct !DILexicalBlock(scope: !209, file: !7, line: 116, column: 9)
!233 = !DILocation(line: 116, column: 9, scope: !209)
!234 = !DILocation(line: 117, column: 9, scope: !235)
!235 = distinct !DILexicalBlock(scope: !232, file: !7, line: 116, column: 20)
!236 = !DILocation(line: 117, column: 15, scope: !235)
!237 = !DILocation(line: 117, column: 24, scope: !235)
!238 = !DILocation(line: 118, column: 9, scope: !235)
!239 = !DILocation(line: 121, column: 5, scope: !209)
!240 = !DILocation(line: 121, column: 15, scope: !209)
!241 = !DILocation(line: 121, column: 23, scope: !209)
!242 = !DILocation(line: 123, column: 5, scope: !209)
!243 = !DILocation(line: 123, column: 12, scope: !209)
!244 = !DILocation(line: 123, column: 23, scope: !209)
!245 = !DILocation(line: 124, column: 25, scope: !209)
!246 = !DILocation(line: 124, column: 31, scope: !209)
!247 = !DILocation(line: 124, column: 5, scope: !209)
!248 = !DILocation(line: 124, column: 12, scope: !209)
!249 = !DILocation(line: 124, column: 23, scope: !209)
!250 = !DILocation(line: 125, column: 25, scope: !209)
!251 = !DILocation(line: 125, column: 31, scope: !209)
!252 = !DILocation(line: 125, column: 5, scope: !209)
!253 = !DILocation(line: 125, column: 12, scope: !209)
!254 = !DILocation(line: 125, column: 23, scope: !209)
!255 = !DILocation(line: 126, column: 25, scope: !209)
!256 = !DILocation(line: 126, column: 31, scope: !209)
!257 = !DILocation(line: 126, column: 5, scope: !209)
!258 = !DILocation(line: 126, column: 12, scope: !209)
!259 = !DILocation(line: 126, column: 23, scope: !209)
!260 = !DILocation(line: 127, column: 25, scope: !209)
!261 = !DILocation(line: 127, column: 31, scope: !209)
!262 = !DILocation(line: 127, column: 5, scope: !209)
!263 = !DILocation(line: 127, column: 12, scope: !209)
