; ModuleID = 'prog'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_s = type { %struct.rbnode_s*, %struct.rbnode_s*, i64, i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }
%struct.rbnode_s = type { i8*, i8*, i8, %struct.rbnode_s*, %struct.rbnode_s*, %struct.rbnode_s* }
%struct.treetable_conf_s = type { i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }

@.str = private unnamed_addr constant [5 x i8] c"key1\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"key2\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"ccStat == CC_ERR_KEY_NOT_FOUND\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"get_first_key.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [11 x i8] c"int main()\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"ccStat == CC_OK\00", align 1
@.str.5 = private unnamed_addr constant [25 x i8] c"*(int*)outputKey == key1\00", align 1
@.str.6 = private unnamed_addr constant [25 x i8] c"*(int*)outputKey == key2\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main() #0 !dbg !32 {
entry:
  %retval = alloca i32, align 4
  %table = alloca %struct.treetable_s*, align 8
  %key1 = alloca i32, align 4
  %key2 = alloca i32, align 4
  %keyArray = alloca [2 x i32], align 4
  %value1 = alloca [10 x i8], align 1

!70 = !DILocation(line: 23, column: 5, scope: !32)
!71 = !DILocation(line: 26, column: 38, scope: !32)
!72 = !DILocation(line: 26, column: 14, scope: !32)
!73 = !DILocation(line: 26, column: 12, scope: !32)
!74 = !DILocation(line: 27, column: 5, scope: !75)
!75 = distinct !DILexicalBlock(scope: !76, file: !1, line: 27, column: 5)
!76 = distinct !DILexicalBlock(scope: !32, file: !1, line: 27, column: 5)
!77 = !DILocation(line: 27, column: 5, scope: !76)
!78 = !DILocation(line: 29, column: 19, scope: !32)
!79 = !DILocation(line: 29, column: 26, scope: !32)
!80 = !DILocation(line: 29, column: 33, scope: !32)
!81 = !DILocation(line: 29, column: 5, scope: !32)
!82 = !DILocation(line: 30, column: 38, scope: !32)
!83 = !DILocation(line: 30, column: 14, scope: !32)
!84 = !DILocation(line: 30, column: 12, scope: !32)
!85 = !DILocation(line: 31, column: 5, scope: !86)
!86 = distinct !DILexicalBlock(scope: !87, file: !1, line: 31, column: 5)
!87 = distinct !DILexicalBlock(scope: !32, file: !1, line: 31, column: 5)
!88 = !DILocation(line: 31, column: 5, scope: !87)
!89 = !DILocation(line: 32, column: 5, scope: !90)
!90 = distinct !DILexicalBlock(scope: !91, file: !1, line: 32, column: 5)
!91 = distinct !DILexicalBlock(scope: !32, file: !1, line: 32, column: 5)
!92 = !DILocation(line: 32, column: 5, scope: !91)
!93 = !DILocation(line: 35, column: 19, scope: !32)
!94 = !DILocation(line: 35, column: 26, scope: !32)
!95 = !DILocation(line: 35, column: 33, scope: !32)
!96 = !DILocation(line: 35, column: 5, scope: !32)
!97 = !DILocation(line: 36, column: 38, scope: !32)
!98 = !DILocation(line: 36, column: 14, scope: !32)
!99 = !DILocation(line: 36, column: 12, scope: !32)
!100 = !DILocation(line: 37, column: 5, scope: !101)
!101 = distinct !DILexicalBlock(scope: !102, file: !1, line: 37, column: 5)
!102 = distinct !DILexicalBlock(scope: !32, file: !1, line: 37, column: 5)
!103 = !DILocation(line: 37, column: 5, scope: !102)
!104 = !DILocation(line: 38, column: 9, scope: !105)
!105 = distinct !DILexicalBlock(scope: !32, file: !1, line: 38, column: 9)
!106 = !DILocation(line: 38, column: 17, scope: !105)
!107 = !DILocation(line: 38, column: 14, scope: !105)
!108 = !DILocation(line: 38, column: 9, scope: !32)
!109 = !DILocation(line: 39, column: 9, scope: !110)
!110 = distinct !DILexicalBlock(scope: !111, file: !1, line: 39, column: 9)
!111 = distinct !DILexicalBlock(scope: !112, file: !1, line: 39, column: 9)
!112 = distinct !DILexicalBlock(scope: !105, file: !1, line: 38, column: 23)
!113 = !DILocation(line: 39, column: 9, scope: !111)
!114 = !DILocation(line: 41, column: 9, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !1, line: 41, column: 9)
!116 = distinct !DILexicalBlock(scope: !117, file: !1, line: 41, column: 9)
!117 = distinct !DILexicalBlock(scope: !105, file: !1, line: 40, column: 12)
!118 = !DILocation(line: 41, column: 9, scope: !116)
!119 = !DILocation(line: 44, column: 23, scope: !32)
!120 = !DILocation(line: 44, column: 5, scope: !32)
!121 = !DILocation(line: 45, column: 1, scope: !32)
!122 = distinct !DISubprogram(name: "cmp", scope: !20, file: !20, line: 53, type: !123, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!123 = !DISubroutineType(types: !124)
!124 = !{!18, !125, !125}
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!127 = !DILocalVariable(name: "e1", arg: 1, scope: !122, file: !20, line: 53, type: !125)
!128 = !DILocation(line: 53, column: 21, scope: !122)
!129 = !DILocalVariable(name: "e2", arg: 2, scope: !122, file: !20, line: 53, type: !125)
!130 = !DILocation(line: 53, column: 37, scope: !122)
!131 = !DILocalVariable(name: "i", scope: !122, file: !20, line: 54, type: !18)
!132 = !DILocation(line: 54, column: 9, scope: !122)
!133 = !DILocation(line: 54, column: 22, scope: !122)
!134 = !DILocation(line: 54, column: 15, scope: !122)
!135 = !DILocation(line: 54, column: 13, scope: !122)
!136 = !DILocalVariable(name: "j", scope: !122, file: !20, line: 55, type: !18)
!137 = !DILocation(line: 55, column: 9, scope: !122)
!138 = !DILocation(line: 55, column: 22, scope: !122)
!139 = !DILocation(line: 55, column: 15, scope: !122)
!140 = !DILocation(line: 55, column: 13, scope: !122)
!141 = !DILocation(line: 57, column: 9, scope: !142)
!142 = distinct !DILexicalBlock(scope: !122, file: !20, line: 57, column: 9)
!143 = !DILocation(line: 57, column: 13, scope: !142)
!144 = !DILocation(line: 57, column: 11, scope: !142)
!145 = !DILocation(line: 57, column: 9, scope: !122)
!146 = !DILocation(line: 58, column: 9, scope: !142)
!147 = !DILocation(line: 59, column: 9, scope: !148)
!148 = distinct !DILexicalBlock(scope: !122, file: !20, line: 59, column: 9)
!149 = !DILocation(line: 59, column: 14, scope: !148)
!150 = !DILocation(line: 59, column: 11, scope: !148)
!151 = !DILocation(line: 59, column: 9, scope: !122)
!152 = !DILocation(line: 60, column: 9, scope: !148)
!153 = !DILocation(line: 61, column: 5, scope: !122)
!154 = !DILocation(line: 62, column: 1, scope: !122)
!155 = distinct !DISubprogram(name: "treetable_conf_init", scope: !20, file: !20, line: 70, type: !156, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!156 = !DISubroutineType(types: !157)
!157 = !{null, !158}
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !160, line: 94, baseType: !161)
!160 = !DIFile(filename: "./treetable.h", directory: "/home/klee/klee_src/examples/trabalho2")
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !160, line: 89, size: 256, elements: !162)
!162 = !{!163, !165, !172, !176}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !161, file: !160, line: 90, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !161, file: !160, line: 91, baseType: !166, size: 64, offset: 64)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !167, size: 64)
!167 = !DISubroutineType(types: !168)
!168 = !{!25, !169}
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !170, line: 46, baseType: !171)
!170 = !DIFile(filename: "/tmp/llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "")
!171 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !161, file: !160, line: 92, baseType: !173, size: 64, offset: 128)
!173 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !174, size: 64)
!174 = !DISubroutineType(types: !175)
!175 = !{!25, !169, !169}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !161, file: !160, line: 93, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = !DISubroutineType(types: !179)
!179 = !{null, !25}
!180 = !DILocalVariable(name: "conf", arg: 1, scope: !155, file: !20, line: 70, type: !158)
!181 = !DILocation(line: 70, column: 41, scope: !155)
!182 = !DILocation(line: 72, column: 5, scope: !155)
!183 = !DILocation(line: 72, column: 11, scope: !155)
!184 = !DILocation(line: 72, column: 22, scope: !155)
!185 = !DILocation(line: 73, column: 5, scope: !155)
!186 = !DILocation(line: 73, column: 11, scope: !155)
!187 = !DILocation(line: 73, column: 22, scope: !155)
!188 = !DILocation(line: 74, column: 5, scope: !155)
!189 = !DILocation(line: 74, column: 11, scope: !155)
!190 = !DILocation(line: 74, column: 22, scope: !155)
!191 = !DILocation(line: 75, column: 5, scope: !155)
!192 = !DILocation(line: 75, column: 11, scope: !155)
!193 = !DILocation(line: 75, column: 22, scope: !155)
!194 = !DILocation(line: 76, column: 1, scope: !155)
!195 = distinct !DISubprogram(name: "treetable_new", scope: !20, file: !20, line: 87, type: !196, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!196 = !DISubroutineType(types: !197)
!197 = !{!22, !198}
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !200, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !160, line: 30, baseType: !201)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !20, line: 30, size: 448, elements: !202)
!202 = !{!203, !215, !216, !217, !218, !219, !220}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !201, file: !20, line: 31, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64)
!205 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !160, line: 61, baseType: !206)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !160, line: 37, size: 384, elements: !207)
!207 = !{!208, !209, !210, !211, !213, !214}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !206, file: !160, line: 40, baseType: !25, size: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !206, file: !160, line: 44, baseType: !25, size: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !206, file: !160, line: 48, baseType: !57, size: 8, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !206, file: !160, line: 52, baseType: !212, size: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !206, file: !160, line: 56, baseType: !212, size: 64, offset: 256)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !206, file: !160, line: 60, baseType: !212, size: 64, offset: 320)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !201, file: !20, line: 32, baseType: !204, size: 64, offset: 64)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !201, file: !20, line: 33, baseType: !169, size: 64, offset: 128)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !201, file: !20, line: 35, baseType: !164, size: 64, offset: 192)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !201, file: !20, line: 36, baseType: !166, size: 64, offset: 256)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !201, file: !20, line: 37, baseType: !173, size: 64, offset: 320)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !201, file: !20, line: 38, baseType: !177, size: 64, offset: 384)
!221 = !DILocalVariable(name: "tt", arg: 1, scope: !195, file: !20, line: 87, type: !198)
!222 = !DILocation(line: 87, column: 40, scope: !195)
!223 = !DILocalVariable(name: "conf", scope: !195, file: !20, line: 89, type: !159)
!224 = !DILocation(line: 89, column: 19, scope: !195)
!225 = !DILocation(line: 90, column: 5, scope: !195)
!226 = !DILocation(line: 91, column: 38, scope: !195)
!227 = !DILocation(line: 91, column: 12, scope: !195)
!228 = !DILocation(line: 91, column: 5, scope: !195)
!229 = distinct !DISubprogram(name: "treetable_new_conf", scope: !20, file: !20, line: 107, type: !230, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!230 = !DISubroutineType(types: !231)
!231 = !{!22, !232, !198}
!232 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !233)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !234, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !159)
!235 = !DILocalVariable(name: "conf", arg: 1, scope: !229, file: !20, line: 107, type: !232)
!236 = !DILocation(line: 107, column: 61, scope: !229)
!237 = !DILocalVariable(name: "tt", arg: 2, scope: !229, file: !20, line: 107, type: !198)
!238 = !DILocation(line: 107, column: 79, scope: !229)
!239 = !DILocalVariable(name: "table", scope: !229, file: !20, line: 109, type: !199)
!240 = !DILocation(line: 109, column: 16, scope: !229)
!241 = !DILocation(line: 109, column: 24, scope: !229)
!242 = !DILocation(line: 109, column: 30, scope: !229)
!243 = !DILocation(line: 111, column: 10, scope: !244)
!244 = distinct !DILexicalBlock(scope: !229, file: !20, line: 111, column: 9)
!245 = !DILocation(line: 111, column: 9, scope: !229)
!246 = !DILocation(line: 112, column: 9, scope: !244)
!247 = !DILocalVariable(name: "sentinel", scope: !229, file: !20, line: 114, type: !204)
!248 = !DILocation(line: 114, column: 13, scope: !229)
!249 = !DILocation(line: 114, column: 24, scope: !229)
!250 = !DILocation(line: 114, column: 30, scope: !229)
!251 = !DILocation(line: 116, column: 10, scope: !252)
!252 = distinct !DILexicalBlock(scope: !229, file: !20, line: 116, column: 9)
!253 = !DILocation(line: 116, column: 9, scope: !229)
!254 = !DILocation(line: 117, column: 9, scope: !255)
!255 = distinct !DILexicalBlock(scope: !252, file: !20, line: 116, column: 20)
!256 = !DILocation(line: 117, column: 15, scope: !255)
!257 = !DILocation(line: 117, column: 24, scope: !255)
!258 = !DILocation(line: 118, column: 9, scope: !255)
!259 = !DILocation(line: 121, column: 5, scope: !229)
!260 = !DILocation(line: 121, column: 15, scope: !229)
!261 = !DILocation(line: 121, column: 23, scope: !229)
!262 = !DILocation(line: 123, column: 5, scope: !229)
!263 = !DILocation(line: 123, column: 12, scope: !229)
!264 = !DILocation(line: 123, column: 23, scope: !229)
!265 = !DILocation(line: 124, column: 25, scope: !229)
!266 = !DILocation(line: 124, column: 31, scope: !229)
!267 = !DILocation(line: 124, column: 5, scope: !229)
!268 = !DILocation(line: 124, column: 12, scope: !229)
!269 = !DILocation(line: 124, column: 23, scope: !229)
!270 = !DILocation(line: 125, column: 25, scope: !229)
!271 = !DILocation(line: 125, column: 31, scope: !229)
!272 = !DILocation(line: 125, column: 5, scope: !229)
!273 = !DILocation(line: 125, column: 12, scope: !229)
!274 = !DILocation(line: 125, column: 23, scope: !229)
!275 = !DILocation(line: 126, column: 25, scope: !229)
!276 = !DILocation(line: 126, column: 31, scope: !229)
!277 = !DILocation(line: 126, column: 5, scope: !229)
!278 = !DILocation(line: 126, column: 12, scope: !229)
!279 = !DILocation(line: 126, column: 23, scope: !229)
!280 = !DILocation(line: 127, column: 25, scope: !229)
!281 = !DILocation(line: 127, column: 31, scope: !229)
!282 = !DILocation(line: 127, column: 5, scope: !229)
!283 = !DILocation(line: 127, column: 12, scope: !229)
