; ModuleID = 'prog'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_s = type { %struct.rbnode_s*, %struct.rbnode_s*, i64, i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }
%struct.rbnode_s = type { i8*, i8*, i8, %struct.rbnode_s*, %struct.rbnode_s*, %struct.rbnode_s* }
%struct.treetable_conf_s = type { i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }

@__const.main.value1 = private unnamed_addr constant [4 x i8] c"aaa\00", align 1
@__const.main.value2 = private unnamed_addr constant [4 x i8] c"bbb\00", align 1
@.str = private unnamed_addr constant [5 x i8] c"key1\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"key2\00", align 1
@.str.2 = private unnamed_addr constant [31 x i8] c"ccStat == CC_ERR_KEY_NOT_FOUND\00", align 1
@.str.3 = private unnamed_addr constant [11 x i8] c"get_keys.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [11 x i8] c"int main()\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"ccStat == CC_OK\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main() #0 !dbg !34 {
entry:
  %table = alloca %struct.treetable_s*, align 8
  %key1 = alloca i32, align 4
  %key2 = alloca i32, align 4
  %value1 = alloca [4 x i8], align 1
  %value2 = alloca [4 x i8], align 1
  %ccStat = alloca i32, align 4

!37 = !DILocalVariable(name: "table", scope: !34, file: !1, line: 8, type: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !40, line: 30, baseType: !41)
!40 = !DIFile(filename: "./../treetable.h", directory: "/home/klee/klee_src/examples/trabalho2/Ex2SymbTestSuite")
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !40, line: 30, flags: DIFlagFwdDecl)
!42 = !DILocation(line: 8, column: 16, scope: !34)
!43 = !DILocation(line: 9, column: 5, scope: !34)
!44 = !DILocalVariable(name: "key1", scope: !34, file: !1, line: 11, type: !23)
!45 = !DILocation(line: 11, column: 9, scope: !34)
!46 = !DILocalVariable(name: "key2", scope: !34, file: !1, line: 12, type: !23)
!47 = !DILocation(line: 12, column: 9, scope: !34)
!48 = !DILocalVariable(name: "value1", scope: !34, file: !1, line: 14, type: !49)
!49 = !DICompositeType(tag: DW_TAG_array_type, baseType: !50, size: 32, elements: !51)
!50 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!51 = !{!52}
!52 = !DISubrange(count: 4)
!53 = !DILocation(line: 14, column: 10, scope: !34)
!54 = !DILocalVariable(name: "value2", scope: !34, file: !1, line: 15, type: !49)
!55 = !DILocation(line: 15, column: 10, scope: !34)
!56 = !DILocalVariable(name: "ccStat", scope: !34, file: !1, line: 17, type: !23)
!57 = !DILocation(line: 17, column: 9, scope: !34)
!58 = !DILocalVariable(name: "valueObtained", scope: !34, file: !1, line: 18, type: !24)
!59 = !DILocation(line: 18, column: 11, scope: !34)
!60 = !DILocation(line: 20, column: 24, scope: !34)
!61 = !DILocation(line: 20, column: 5, scope: !34)
!62 = !DILocation(line: 21, column: 24, scope: !34)
!63 = !DILocation(line: 21, column: 5, scope: !34)
!64 = !DILocation(line: 23, column: 28, scope: !34)
!65 = !DILocation(line: 23, column: 35, scope: !34)
!66 = !DILocation(line: 23, column: 14, scope: !34)
!67 = !DILocation(line: 23, column: 12, scope: !34)
!68 = !DILocation(line: 24, column: 5, scope: !69)
!69 = distinct !DILexicalBlock(scope: !70, file: !1, line: 24, column: 5)
!70 = distinct !DILexicalBlock(scope: !34, file: !1, line: 24, column: 5)
!71 = !DILocation(line: 24, column: 5, scope: !70)
!72 = !DILocation(line: 26, column: 19, scope: !34)
!73 = !DILocation(line: 26, column: 26, scope: !34)
!74 = !DILocation(line: 26, column: 33, scope: !34)
!75 = !DILocation(line: 26, column: 5, scope: !34)
!76 = !DILocation(line: 28, column: 28, scope: !34)
!77 = !DILocation(line: 28, column: 35, scope: !34)
!78 = !DILocation(line: 28, column: 14, scope: !34)
!79 = !DILocation(line: 28, column: 12, scope: !34)
!80 = !DILocation(line: 29, column: 5, scope: !81)
!81 = distinct !DILexicalBlock(scope: !82, file: !1, line: 29, column: 5)
!82 = distinct !DILexicalBlock(scope: !34, file: !1, line: 29, column: 5)
!83 = !DILocation(line: 29, column: 5, scope: !82)
!84 = !DILocation(line: 31, column: 23, scope: !34)
!85 = !DILocation(line: 31, column: 5, scope: !34)
!86 = !DILocation(line: 32, column: 1, scope: !34)
!87 = distinct !DISubprogram(name: "cmp", scope: !17, file: !17, line: 53, type: !88, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !27)
!88 = !DISubroutineType(types: !89)
!89 = !{!23, !90, !90}
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!92 = !DILocalVariable(name: "e1", arg: 1, scope: !87, file: !17, line: 53, type: !90)
!93 = !DILocation(line: 53, column: 21, scope: !87)
!94 = !DILocalVariable(name: "e2", arg: 2, scope: !87, file: !17, line: 53, type: !90)
!95 = !DILocation(line: 53, column: 37, scope: !87)
!96 = !DILocalVariable(name: "i", scope: !87, file: !17, line: 54, type: !23)
!97 = !DILocation(line: 54, column: 9, scope: !87)
!98 = !DILocation(line: 54, column: 22, scope: !87)
!99 = !DILocation(line: 54, column: 15, scope: !87)
!100 = !DILocation(line: 54, column: 13, scope: !87)
!101 = !DILocalVariable(name: "j", scope: !87, file: !17, line: 55, type: !23)
!102 = !DILocation(line: 55, column: 9, scope: !87)
!103 = !DILocation(line: 55, column: 22, scope: !87)
!104 = !DILocation(line: 55, column: 15, scope: !87)
!105 = !DILocation(line: 55, column: 13, scope: !87)
!106 = !DILocation(line: 57, column: 9, scope: !107)
!107 = distinct !DILexicalBlock(scope: !87, file: !17, line: 57, column: 9)
!108 = !DILocation(line: 57, column: 13, scope: !107)
!109 = !DILocation(line: 57, column: 11, scope: !107)
!110 = !DILocation(line: 57, column: 9, scope: !87)
!111 = !DILocation(line: 58, column: 9, scope: !107)
!112 = !DILocation(line: 59, column: 9, scope: !113)
!113 = distinct !DILexicalBlock(scope: !87, file: !17, line: 59, column: 9)
!114 = !DILocation(line: 59, column: 14, scope: !113)
!115 = !DILocation(line: 59, column: 11, scope: !113)
!116 = !DILocation(line: 59, column: 9, scope: !87)
!117 = !DILocation(line: 60, column: 9, scope: !113)
!118 = !DILocation(line: 61, column: 5, scope: !87)
!119 = !DILocation(line: 62, column: 1, scope: !87)
!120 = distinct !DISubprogram(name: "treetable_conf_init", scope: !17, file: !17, line: 70, type: !121, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !27)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !123}
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !125, line: 94, baseType: !126)
!125 = !DIFile(filename: "./treetable.h", directory: "/home/klee/klee_src/examples/trabalho2")
!126 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !125, line: 89, size: 256, elements: !127)
!127 = !{!128, !130, !137, !141}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !126, file: !125, line: 90, baseType: !129, size: 64)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !126, file: !125, line: 91, baseType: !131, size: 64, offset: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DISubroutineType(types: !133)
!133 = !{!24, !134}
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !135, line: 46, baseType: !136)
!135 = !DIFile(filename: "/tmp/llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "")
!136 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !126, file: !125, line: 92, baseType: !138, size: 64, offset: 128)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DISubroutineType(types: !140)
!140 = !{!24, !134, !134}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !126, file: !125, line: 93, baseType: !142, size: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !143, size: 64)
!143 = !DISubroutineType(types: !144)
!144 = !{null, !24}
!145 = !DILocalVariable(name: "conf", arg: 1, scope: !120, file: !17, line: 70, type: !123)
!146 = !DILocation(line: 70, column: 41, scope: !120)
!147 = !DILocation(line: 72, column: 5, scope: !120)
!148 = !DILocation(line: 72, column: 11, scope: !120)
!149 = !DILocation(line: 72, column: 22, scope: !120)
!150 = !DILocation(line: 73, column: 5, scope: !120)
!151 = !DILocation(line: 73, column: 11, scope: !120)
!152 = !DILocation(line: 73, column: 22, scope: !120)
!153 = !DILocation(line: 74, column: 5, scope: !120)
!154 = !DILocation(line: 74, column: 11, scope: !120)
!155 = !DILocation(line: 74, column: 22, scope: !120)
!156 = !DILocation(line: 75, column: 5, scope: !120)
!157 = !DILocation(line: 75, column: 11, scope: !120)
!158 = !DILocation(line: 75, column: 22, scope: !120)
!159 = !DILocation(line: 76, column: 1, scope: !120)
!160 = distinct !DISubprogram(name: "treetable_new", scope: !17, file: !17, line: 87, type: !161, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !27)
!161 = !DISubroutineType(types: !162)
!162 = !{!19, !163}
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !125, line: 30, baseType: !166)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !17, line: 30, size: 448, elements: !167)
!167 = !{!168, !180, !181, !182, !183, !184, !185}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !166, file: !17, line: 31, baseType: !169, size: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64)
!170 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !125, line: 61, baseType: !171)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !125, line: 37, size: 384, elements: !172)
!172 = !{!173, !174, !175, !176, !178, !179}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !171, file: !125, line: 40, baseType: !24, size: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !171, file: !125, line: 44, baseType: !24, size: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !171, file: !125, line: 48, baseType: !50, size: 8, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !171, file: !125, line: 52, baseType: !177, size: 64, offset: 192)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !171, size: 64)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !171, file: !125, line: 56, baseType: !177, size: 64, offset: 256)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !171, file: !125, line: 60, baseType: !177, size: 64, offset: 320)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !166, file: !17, line: 32, baseType: !169, size: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !166, file: !17, line: 33, baseType: !134, size: 64, offset: 128)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !166, file: !17, line: 35, baseType: !129, size: 64, offset: 192)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !166, file: !17, line: 36, baseType: !131, size: 64, offset: 256)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !166, file: !17, line: 37, baseType: !138, size: 64, offset: 320)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !166, file: !17, line: 38, baseType: !142, size: 64, offset: 384)
!186 = !DILocalVariable(name: "tt", arg: 1, scope: !160, file: !17, line: 87, type: !163)
!187 = !DILocation(line: 87, column: 40, scope: !160)
!188 = !DILocalVariable(name: "conf", scope: !160, file: !17, line: 89, type: !124)
!189 = !DILocation(line: 89, column: 19, scope: !160)
!190 = !DILocation(line: 90, column: 5, scope: !160)
!191 = !DILocation(line: 91, column: 38, scope: !160)
!192 = !DILocation(line: 91, column: 12, scope: !160)
!193 = !DILocation(line: 91, column: 5, scope: !160)
!194 = distinct !DISubprogram(name: "treetable_new_conf", scope: !17, file: !17, line: 107, type: !195, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !16, retainedNodes: !27)
!195 = !DISubroutineType(types: !196)
!196 = !{!19, !197, !163}
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !199, size: 64)
!199 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !124)
!200 = !DILocalVariable(name: "conf", arg: 1, scope: !194, file: !17, line: 107, type: !197)
!201 = !DILocation(line: 107, column: 61, scope: !194)
!202 = !DILocalVariable(name: "tt", arg: 2, scope: !194, file: !17, line: 107, type: !163)
!203 = !DILocation(line: 107, column: 79, scope: !194)
!204 = !DILocalVariable(name: "table", scope: !194, file: !17, line: 109, type: !164)
!205 = !DILocation(line: 109, column: 16, scope: !194)
!206 = !DILocation(line: 109, column: 24, scope: !194)
!207 = !DILocation(line: 109, column: 30, scope: !194)
!208 = !DILocation(line: 111, column: 10, scope: !209)
!209 = distinct !DILexicalBlock(scope: !194, file: !17, line: 111, column: 9)
!210 = !DILocation(line: 111, column: 9, scope: !194)
!211 = !DILocation(line: 112, column: 9, scope: !209)
!212 = !DILocalVariable(name: "sentinel", scope: !194, file: !17, line: 114, type: !169)
!213 = !DILocation(line: 114, column: 13, scope: !194)
!214 = !DILocation(line: 114, column: 24, scope: !194)
!215 = !DILocation(line: 114, column: 30, scope: !194)
!216 = !DILocation(line: 116, column: 10, scope: !217)
!217 = distinct !DILexicalBlock(scope: !194, file: !17, line: 116, column: 9)
!218 = !DILocation(line: 116, column: 9, scope: !194)
!219 = !DILocation(line: 117, column: 9, scope: !220)
!220 = distinct !DILexicalBlock(scope: !217, file: !17, line: 116, column: 20)
!221 = !DILocation(line: 117, column: 15, scope: !220)
!222 = !DILocation(line: 117, column: 24, scope: !220)
!223 = !DILocation(line: 118, column: 9, scope: !220)
!224 = !DILocation(line: 121, column: 5, scope: !194)
!225 = !DILocation(line: 121, column: 15, scope: !194)
!226 = !DILocation(line: 121, column: 23, scope: !194)
!227 = !DILocation(line: 123, column: 5, scope: !194)
!228 = !DILocation(line: 123, column: 12, scope: !194)
!229 = !DILocation(line: 123, column: 23, scope: !194)
!230 = !DILocation(line: 124, column: 25, scope: !194)
!231 = !DILocation(line: 124, column: 31, scope: !194)
!232 = !DILocation(line: 124, column: 5, scope: !194)
!233 = !DILocation(line: 124, column: 12, scope: !194)
!234 = !DILocation(line: 124, column: 23, scope: !194)
!235 = !DILocation(line: 125, column: 25, scope: !194)
!236 = !DILocation(line: 125, column: 31, scope: !194)
!237 = !DILocation(line: 125, column: 5, scope: !194)
!238 = !DILocation(line: 125, column: 12, scope: !194)
!239 = !DILocation(line: 125, column: 23, scope: !194)
!240 = !DILocation(line: 126, column: 25, scope: !194)
!241 = !DILocation(line: 126, column: 31, scope: !194)
!242 = !DILocation(line: 126, column: 5, scope: !194)
!243 = !DILocation(line: 126, column: 12, scope: !194)
!244 = !DILocation(line: 126, column: 23, scope: !194)
!245 = !DILocation(line: 127, column: 25, scope: !194)
!246 = !DILocation(line: 127, column: 31, scope: !194)
!247 = !DILocation(line: 127, column: 5, scope: !194)
!248 = !DILocation(line: 127, column: 12, scope: !194)
