; ModuleID = 'prog'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.treetable_s = type { %struct.rbnode_s*, %struct.rbnode_s*, i64, i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }
%struct.rbnode_s = type { i8*, i8*, i8, %struct.rbnode_s*, %struct.rbnode_s*, %struct.rbnode_s* }
%struct.treetable_conf_s = type { i32 (i8*, i8*)*, i8* (i64)*, i8* (i64, i64)*, void (i8*)* }

@.str = private unnamed_addr constant [5 x i8] c"key1\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"key2\00", align 1
@.str.2 = private unnamed_addr constant [30 x i8] c"*(int*)outputKey > currentKey\00", align 1
@.str.3 = private unnamed_addr constant [19 x i8] c"get_greater_node.c\00", align 1
@__PRETTY_FUNCTION__.main = private unnamed_addr constant [11 x i8] c"int main()\00", align 1
@.str.4 = private unnamed_addr constant [31 x i8] c"ccStat == CC_ERR_KEY_NOT_FOUND\00", align 1

; Function Attrs: noinline nounwind uwtable
define dso_local i32 @main() #0 !dbg !32 {
entry:
  %retval = alloca i32, align 4
  %table = alloca %struct.treetable_s*, align 8
  %key1 = alloca i32, align 4
  %key2 = alloca i32, align 4
  %keyArray = alloca [2 x i32], align 4
  %value1 = alloca [10 x i8], align 1
  %value2 = alloca [10 x i8], align 1
  %outputKey = alloca i8*, align 8
  %i = alloca i32, align 4
  %currentKey = alloca i32, align 4
  %ccStat = alloca i32, align 4

!61 = !DILocalVariable(name: "value2", scope: !32, file: !1, line: 17, type: !56)
!62 = !DILocation(line: 17, column: 10, scope: !32)
!63 = !DILocation(line: 19, column: 24, scope: !32)
!64 = !DILocation(line: 19, column: 5, scope: !32)
!65 = !DILocation(line: 20, column: 24, scope: !32)
!66 = !DILocation(line: 20, column: 5, scope: !32)
!67 = !DILocation(line: 22, column: 19, scope: !32)
!68 = !DILocation(line: 22, column: 26, scope: !32)
!69 = !DILocation(line: 22, column: 33, scope: !32)
!70 = !DILocation(line: 22, column: 5, scope: !32)
!71 = !DILocation(line: 23, column: 19, scope: !32)
!72 = !DILocation(line: 23, column: 26, scope: !32)
!73 = !DILocation(line: 23, column: 33, scope: !32)
!74 = !DILocation(line: 23, column: 5, scope: !32)
!75 = !DILocalVariable(name: "outputKey", scope: !32, file: !1, line: 25, type: !25)
!76 = !DILocation(line: 25, column: 11, scope: !32)
!77 = !DILocalVariable(name: "i", scope: !32, file: !1, line: 27, type: !18)
!78 = !DILocation(line: 27, column: 9, scope: !32)
!79 = !DILocation(line: 28, column: 5, scope: !32)
!80 = !DILocation(line: 28, column: 12, scope: !32)
!81 = !DILocation(line: 28, column: 14, scope: !32)
!82 = !DILocalVariable(name: "currentKey", scope: !83, file: !1, line: 29, type: !18)
!83 = distinct !DILexicalBlock(scope: !32, file: !1, line: 28, column: 19)
!84 = !DILocation(line: 29, column: 13, scope: !83)
!85 = !DILocation(line: 29, column: 35, scope: !83)
!86 = !DILocation(line: 29, column: 26, scope: !83)
!87 = !DILocalVariable(name: "ccStat", scope: !83, file: !1, line: 30, type: !18)
!88 = !DILocation(line: 30, column: 13, scope: !83)
!89 = !DILocation(line: 30, column: 49, scope: !83)
!90 = !DILocation(line: 30, column: 56, scope: !83)
!91 = !DILocation(line: 30, column: 22, scope: !83)
!92 = !DILocation(line: 31, column: 13, scope: !93)
!93 = distinct !DILexicalBlock(scope: !83, file: !1, line: 31, column: 13)
!94 = !DILocation(line: 31, column: 20, scope: !93)
!95 = !DILocation(line: 31, column: 13, scope: !83)
!96 = !DILocation(line: 32, column: 13, scope: !97)
!97 = distinct !DILexicalBlock(scope: !98, file: !1, line: 32, column: 13)
!98 = distinct !DILexicalBlock(scope: !99, file: !1, line: 32, column: 13)
!99 = distinct !DILexicalBlock(scope: !93, file: !1, line: 31, column: 30)
!100 = !DILocation(line: 32, column: 13, scope: !98)
!101 = !DILocation(line: 34, column: 13, scope: !102)
!102 = distinct !DILexicalBlock(scope: !103, file: !1, line: 34, column: 13)
!103 = distinct !DILexicalBlock(scope: !104, file: !1, line: 34, column: 13)
!104 = distinct !DILexicalBlock(scope: !93, file: !1, line: 33, column: 16)
!105 = !DILocation(line: 34, column: 13, scope: !103)
!106 = !DILocation(line: 36, column: 10, scope: !83)
!107 = distinct !{!107, !79, !108, !109}
!108 = !DILocation(line: 37, column: 5, scope: !32)
!109 = !{!"llvm.loop.mustprogress"}
!110 = !DILocation(line: 39, column: 23, scope: !32)
!111 = !DILocation(line: 39, column: 5, scope: !32)
!112 = !DILocation(line: 40, column: 1, scope: !32)
!113 = distinct !DISubprogram(name: "cmp", scope: !20, file: !20, line: 53, type: !114, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!114 = !DISubroutineType(types: !115)
!115 = !{!18, !116, !116}
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!118 = !DILocalVariable(name: "e1", arg: 1, scope: !113, file: !20, line: 53, type: !116)
!119 = !DILocation(line: 53, column: 21, scope: !113)
!120 = !DILocalVariable(name: "e2", arg: 2, scope: !113, file: !20, line: 53, type: !116)
!121 = !DILocation(line: 53, column: 37, scope: !113)
!122 = !DILocalVariable(name: "i", scope: !113, file: !20, line: 54, type: !18)
!123 = !DILocation(line: 54, column: 9, scope: !113)
!124 = !DILocation(line: 54, column: 22, scope: !113)
!125 = !DILocation(line: 54, column: 15, scope: !113)
!126 = !DILocation(line: 54, column: 13, scope: !113)
!127 = !DILocalVariable(name: "j", scope: !113, file: !20, line: 55, type: !18)
!128 = !DILocation(line: 55, column: 9, scope: !113)
!129 = !DILocation(line: 55, column: 22, scope: !113)
!130 = !DILocation(line: 55, column: 15, scope: !113)
!131 = !DILocation(line: 55, column: 13, scope: !113)
!132 = !DILocation(line: 57, column: 9, scope: !133)
!133 = distinct !DILexicalBlock(scope: !113, file: !20, line: 57, column: 9)
!134 = !DILocation(line: 57, column: 13, scope: !133)
!135 = !DILocation(line: 57, column: 11, scope: !133)
!136 = !DILocation(line: 57, column: 9, scope: !113)
!137 = !DILocation(line: 58, column: 9, scope: !133)
!138 = !DILocation(line: 59, column: 9, scope: !139)
!139 = distinct !DILexicalBlock(scope: !113, file: !20, line: 59, column: 9)
!140 = !DILocation(line: 59, column: 14, scope: !139)
!141 = !DILocation(line: 59, column: 11, scope: !139)
!142 = !DILocation(line: 59, column: 9, scope: !113)
!143 = !DILocation(line: 60, column: 9, scope: !139)
!144 = !DILocation(line: 61, column: 5, scope: !113)
!145 = !DILocation(line: 62, column: 1, scope: !113)
!146 = distinct !DISubprogram(name: "treetable_conf_init", scope: !20, file: !20, line: 70, type: !147, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!147 = !DISubroutineType(types: !148)
!148 = !{null, !149}
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTableConf", file: !151, line: 94, baseType: !152)
!151 = !DIFile(filename: "./treetable.h", directory: "/home/klee/klee_src/examples/trabalho2")
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_conf_s", file: !151, line: 89, size: 256, elements: !153)
!153 = !{!154, !156, !163, !167}
!154 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !152, file: !151, line: 90, baseType: !155, size: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !152, file: !151, line: 91, baseType: !157, size: 64, offset: 64)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DISubroutineType(types: !159)
!159 = !{!25, !160}
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !161, line: 46, baseType: !162)
!161 = !DIFile(filename: "/tmp/llvm-130-install_O_D_A/lib/clang/13.0.1/include/stddef.h", directory: "")
!162 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !152, file: !151, line: 92, baseType: !164, size: 64, offset: 128)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DISubroutineType(types: !166)
!166 = !{!25, !160, !160}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !152, file: !151, line: 93, baseType: !168, size: 64, offset: 192)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DISubroutineType(types: !170)
!170 = !{null, !25}
!171 = !DILocalVariable(name: "conf", arg: 1, scope: !146, file: !20, line: 70, type: !149)
!172 = !DILocation(line: 70, column: 41, scope: !146)
!173 = !DILocation(line: 72, column: 5, scope: !146)
!174 = !DILocation(line: 72, column: 11, scope: !146)
!175 = !DILocation(line: 72, column: 22, scope: !146)
!176 = !DILocation(line: 73, column: 5, scope: !146)
!177 = !DILocation(line: 73, column: 11, scope: !146)
!178 = !DILocation(line: 73, column: 22, scope: !146)
!179 = !DILocation(line: 74, column: 5, scope: !146)
!180 = !DILocation(line: 74, column: 11, scope: !146)
!181 = !DILocation(line: 74, column: 22, scope: !146)
!182 = !DILocation(line: 75, column: 5, scope: !146)
!183 = !DILocation(line: 75, column: 11, scope: !146)
!184 = !DILocation(line: 75, column: 22, scope: !146)
!185 = !DILocation(line: 76, column: 1, scope: !146)
!186 = distinct !DISubprogram(name: "treetable_new", scope: !20, file: !20, line: 87, type: !187, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!187 = !DISubroutineType(types: !188)
!188 = !{!22, !189}
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64)
!190 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !191, size: 64)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "TreeTable", file: !151, line: 30, baseType: !192)
!192 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "treetable_s", file: !20, line: 30, size: 448, elements: !193)
!193 = !{!194, !206, !207, !208, !209, !210, !211}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "root", scope: !192, file: !20, line: 31, baseType: !195, size: 64)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64)
!196 = !DIDerivedType(tag: DW_TAG_typedef, name: "RBNode", file: !151, line: 61, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rbnode_s", file: !151, line: 37, size: 384, elements: !198)
!198 = !{!199, !200, !201, !202, !204, !205}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "key", scope: !197, file: !151, line: 40, baseType: !25, size: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !197, file: !151, line: 44, baseType: !25, size: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !197, file: !151, line: 48, baseType: !57, size: 8, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "parent", scope: !197, file: !151, line: 52, baseType: !203, size: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "left", scope: !197, file: !151, line: 56, baseType: !203, size: 64, offset: 256)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "right", scope: !197, file: !151, line: 60, baseType: !203, size: 64, offset: 320)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "sentinel", scope: !192, file: !20, line: 32, baseType: !195, size: 64, offset: 64)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !192, file: !20, line: 33, baseType: !160, size: 64, offset: 128)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "cmp", scope: !192, file: !20, line: 35, baseType: !155, size: 64, offset: 192)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "mem_alloc", scope: !192, file: !20, line: 36, baseType: !157, size: 64, offset: 256)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "mem_calloc", scope: !192, file: !20, line: 37, baseType: !164, size: 64, offset: 320)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "mem_free", scope: !192, file: !20, line: 38, baseType: !168, size: 64, offset: 384)
!212 = !DILocalVariable(name: "tt", arg: 1, scope: !186, file: !20, line: 87, type: !189)
!213 = !DILocation(line: 87, column: 40, scope: !186)
!214 = !DILocalVariable(name: "conf", scope: !186, file: !20, line: 89, type: !150)
!215 = !DILocation(line: 89, column: 19, scope: !186)
!216 = !DILocation(line: 90, column: 5, scope: !186)
!217 = !DILocation(line: 91, column: 38, scope: !186)
!218 = !DILocation(line: 91, column: 12, scope: !186)
!219 = !DILocation(line: 91, column: 5, scope: !186)
!220 = distinct !DISubprogram(name: "treetable_new_conf", scope: !20, file: !20, line: 107, type: !221, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !19, retainedNodes: !35)
!221 = !DISubroutineType(types: !222)
!222 = !{!22, !223, !189}
!223 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !224)
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !150)
!226 = !DILocalVariable(name: "conf", arg: 1, scope: !220, file: !20, line: 107, type: !223)
!227 = !DILocation(line: 107, column: 61, scope: !220)
!228 = !DILocalVariable(name: "tt", arg: 2, scope: !220, file: !20, line: 107, type: !189)
!229 = !DILocation(line: 107, column: 79, scope: !220)
!230 = !DILocalVariable(name: "table", scope: !220, file: !20, line: 109, type: !190)
!231 = !DILocation(line: 109, column: 16, scope: !220)
!232 = !DILocation(line: 109, column: 24, scope: !220)
!233 = !DILocation(line: 109, column: 30, scope: !220)
!234 = !DILocation(line: 111, column: 10, scope: !235)
!235 = distinct !DILexicalBlock(scope: !220, file: !20, line: 111, column: 9)
!236 = !DILocation(line: 111, column: 9, scope: !220)
!237 = !DILocation(line: 112, column: 9, scope: !235)
!238 = !DILocalVariable(name: "sentinel", scope: !220, file: !20, line: 114, type: !195)
!239 = !DILocation(line: 114, column: 13, scope: !220)
!240 = !DILocation(line: 114, column: 24, scope: !220)
!241 = !DILocation(line: 114, column: 30, scope: !220)
!242 = !DILocation(line: 116, column: 10, scope: !243)
!243 = distinct !DILexicalBlock(scope: !220, file: !20, line: 116, column: 9)
!244 = !DILocation(line: 116, column: 9, scope: !220)
!245 = !DILocation(line: 117, column: 9, scope: !246)
!246 = distinct !DILexicalBlock(scope: !243, file: !20, line: 116, column: 20)
!247 = !DILocation(line: 117, column: 15, scope: !246)
!248 = !DILocation(line: 117, column: 24, scope: !246)
!249 = !DILocation(line: 118, column: 9, scope: !246)
!250 = !DILocation(line: 121, column: 5, scope: !220)
!251 = !DILocation(line: 121, column: 15, scope: !220)
!252 = !DILocation(line: 121, column: 23, scope: !220)
!253 = !DILocation(line: 123, column: 5, scope: !220)
!254 = !DILocation(line: 123, column: 12, scope: !220)
!255 = !DILocation(line: 123, column: 23, scope: !220)
!256 = !DILocation(line: 124, column: 25, scope: !220)
!257 = !DILocation(line: 124, column: 31, scope: !220)
!258 = !DILocation(line: 124, column: 5, scope: !220)
!259 = !DILocation(line: 124, column: 12, scope: !220)
!260 = !DILocation(line: 124, column: 23, scope: !220)
!261 = !DILocation(line: 125, column: 25, scope: !220)
!262 = !DILocation(line: 125, column: 31, scope: !220)
!263 = !DILocation(line: 125, column: 5, scope: !220)
!264 = !DILocation(line: 125, column: 12, scope: !220)
!265 = !DILocation(line: 125, column: 23, scope: !220)
!266 = !DILocation(line: 126, column: 25, scope: !220)
!267 = !DILocation(line: 126, column: 31, scope: !220)
!268 = !DILocation(line: 126, column: 5, scope: !220)
!269 = !DILocation(line: 126, column: 12, scope: !220)
!270 = !DILocation(line: 126, column: 23, scope: !220)
!271 = !DILocation(line: 127, column: 25, scope: !220)
!272 = !DILocation(line: 127, column: 31, scope: !220)
!273 = !DILocation(line: 127, column: 5, scope: !220)
!274 = !DILocation(line: 127, column: 12, scope: !220)
